第二轮测试截图/TRSP00-珠海路桥/自助缴费/自助缴费测试代码.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://gdeupsb.service.bankcomm.com/basic/atomic/operation.ZHEUPSTransportService/Schema" xmlns:gsp="http://gsp.bankcomm.com" xmlns:bbip="http://bbip.bankcomm.com">

   <soapenv:Body>
      <sch:transportFeeCharge>
        <gsp:requestInformation>
            <gsp:traceNo>3003440020150213000000002807</gsp:traceNo>
            <gsp:version>1.00</gsp:version>
            <!--Optional:-->
            <gsp:traceSrc></gsp:traceSrc>
         </gsp:requestInformation>
         <sch:request>
            <sch:requestHeader>
               <bbip:bbipRequestHead>
                  <!--Optional:-->
                  <bbip:txnCde>1</bbip:txnCde>
                  <bbip:chn>00</bbip:chn>
                  <!--Optional:-->
                  <bbip:reqSysCde>GDEUPSA</bbip:reqSysCde>
                  <!--Optional:-->
                  <bbip:subSysCde></bbip:subSysCde>
                  <!--Optional:-->
                  <bbip:bbipBusCde></bbip:bbipBusCde>
                  <bbip:reqJrnNo>20150214012141228901</bbip:reqJrnNo>
                  <bbip:tlr>ABIR148</bbip:tlr>
                  <bbip:br>01441131999</bbip:br>
                  <bbip:bk>01441999999</bbip:bk>
                  <!--Optional:-->
                  <bbip:tlrTmlId>1</bbip:tlrTmlId>
                  <!--Optional:-->
                  <bbip:reqTyp>T</bbip:reqTyp>
                  <!--Optional:-->
                  <bbip:authLvl></bbip:authLvl>
                  <!--Optional:-->
                  <bbip:sup1Id></bbip:sup1Id>
                  <!--Optional:-->
                  <bbip:sup1Auth></bbip:sup1Auth>
                  <!--Optional:-->
                  <bbip:sup2Id></bbip:sup2Id>
                  <!--Optional:-->
                  <bbip:sup2Auth></bbip:sup2Auth>
                  <!--Optional:-->
                  <bbip:authResnTbl>
                     <bbip:authResn></bbip:authResn>
                     <bbip:authResn></bbip:authResn>
                     <bbip:authResn></bbip:authResn>
                     <bbip:authResn></bbip:authResn>
                     <bbip:authResn></bbip:authResn>
                     <bbip:authResn></bbip:authResn>
                     <bbip:authResn></bbip:authResn>
                     <bbip:authResn></bbip:authResn>
                     <bbip:authResn></bbip:authResn>
                     <bbip:authResn></bbip:authResn>
                  </bbip:authResnTbl>
                  <!--Optional:-->
                  <bbip:authLog></bbip:authLog>
                  <!--Optional:-->
                  <bbip:filler></bbip:filler>
                  <bbip:reqTme>2015-02-14T10:12:00</bbip:reqTme>
               </bbip:bbipRequestHead>
            </sch:requestHeader>
            <sch:eupsBusTyp>TRSP00</sch:eupsBusTyp>
            <sch:carNo>‘¡C6B318</sch:carNo>
            <!--Optional:-->
            <sch:carTyp>A1</sch:carTyp>
            <sch:actNo>6222600710008248926</sch:actNo>
            <sch:pinBlk>111111</sch:pinBlk>
            <sch:payMon>12</sch:payMon>
         </sch:request>
      </sch:transportFeeCharge>
   </soapenv:Body>
</soapenv:Envelope>