第二轮测试截图/TRSP00-珠海路桥/欠费查询/欠费查询测试代码.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://gdeupsb.service.bankcomm.com/basic/atomic/operation.ZHEUPSTransportService/Schema" xmlns:gsp="http://gsp.bankcomm.com" xmlns:bbip="http://bbip.bankcomm.com">
 
   <soapenv:Body>
      <sch:transportFeeQuery>
         <gsp:requestInformation>
            <gsp:traceNo>1</gsp:traceNo>
            <gsp:version>1</gsp:version>
            <!--Optional:-->
            <gsp:traceSrc>1</gsp:traceSrc>
         </gsp:requestInformation>
         <sch:request>
            <!--Optional:-->
            <sch:requestHeader>
               <bbip:bbipRequestHead>
                  <!--Optional:-->
                  <bbip:txnCde>1</bbip:txnCde>
                  <bbip:chn>1</bbip:chn>
                  <!--Optional:-->
                  <bbip:reqSysCde>1</bbip:reqSysCde>
                  <!--Optional:-->
                  <bbip:subSysCde>1</bbip:subSysCde>
                  <!--Optional:-->
                  <bbip:bbipBusCde>1</bbip:bbipBusCde>
                  <bbip:reqJrnNo>1</bbip:reqJrnNo>
                  <bbip:tlr>444021</bbip:tlr>
                  <bbip:br>1</bbip:br>
                  <bbip:bk>100</bbip:bk>
                  <!--Optional:-->
                  <bbip:tlrTmlId>AFAM101</bbip:tlrTmlId>
                  <!--Optional:-->
                  <bbip:reqTyp>1</bbip:reqTyp>
                  <!--Optional:-->
                  <bbip:authLvl>1</bbip:authLvl>
                  <!--Optional:-->
                  <bbip:sup1Id></bbip:sup1Id>
                  <!--Optional:-->
                  <bbip:sup1Auth>1</bbip:sup1Auth>
                  <!--Optional:-->
                  <bbip:sup2Id>1</bbip:sup2Id>
                  <!--Optional:-->
                  <bbip:sup2Auth>1</bbip:sup2Auth>
                  <!--Optional:-->
                  <bbip:authResnTbl>
                     <bbip:authResn>1</bbip:authResn>
                     <bbip:authResn>1</bbip:authResn>
                     <bbip:authResn>1</bbip:authResn>
                     <bbip:authResn>1</bbip:authResn>
                     <bbip:authResn>1</bbip:authResn>
                     <bbip:authResn>1</bbip:authResn>
                     <bbip:authResn>1</bbip:authResn>
                     <bbip:authResn>1</bbip:authResn>
                     <bbip:authResn>1</bbip:authResn>
                     <bbip:authResn>1</bbip:authResn>
                  </bbip:authResnTbl>
                  <!--Optional:-->
                  <bbip:authLog>1</bbip:authLog>
                  <!--Optional:-->
                  <bbip:filler>1</bbip:filler>
                  <bbip:reqTme>2014-05-26T00:00:09</bbip:reqTme>
               </bbip:bbipRequestHead>
            </sch:requestHeader>
            <sch:eupsBusTyp>TRSP00</sch:eupsBusTyp>
            <sch:carNo>‘¡C6B318</sch:carNo>
            <!--Optional:-->
            <sch:carTyp>A1</sch:carTyp>
            <!--Optional:-->
            <sch:payMon>12</sch:payMon>
         </sch:request>
      </sch:transportFeeQuery>
   </soapenv:Body>
</soapenv:Envelope>